Franch-Toast/Desktop_Small_Screen_Project/Hardware_design/chips_datasheet/屏幕/GDEW0154T8-data/GDEW0154T8-STM32F103例程（FL）-201022/User/Display_EPD_W21_spi.h

#ifndef _MCU_SPI_H_
#define _MCU_SPI_H_
 #include "stm32f10x.h"

#define EPD_W21_SPI_SPEED 0x02

//#define EPD_W21_VPP_0	P4 &= ~0x80
//#define EPD_W21_VPP_1	P4 |= 0x80

#define EPD_W21_MOSI_0	GPIO_ResetBits(GPIOA, GPIO_Pin_0)
#define EPD_W21_MOSI_1	GPIO_SetBits(GPIOA, GPIO_Pin_0)

#define EPD_W21_CLK_0	GPIO_ResetBits(GPIOA, GPIO_Pin_1)
#define EPD_W21_CLK_1	GPIO_SetBits(GPIOA, GPIO_Pin_1)

#define EPD_W21_CS_0	GPIO_ResetBits(GPIOA, GPIO_Pin_2)
#define EPD_W21_CS_1	GPIO_SetBits(GPIOA, GPIO_Pin_2)

#define EPD_W21_DC_0	GPIO_ResetBits(GPIOA, GPIO_Pin_3)
#define EPD_W21_DC_1	GPIO_SetBits(GPIOA, GPIO_Pin_3)

#define EPD_W21_RST_0	GPIO_ResetBits(GPIOA, GPIO_Pin_4)
#define EPD_W21_RST_1	GPIO_SetBits(GPIOA, GPIO_Pin_4)

#define EPD_W21_BS_0	GPIO_ResetBits(GPIOE, GPIO_Pin_11)
//#define EPD_W21_BS_1	P2 |= 0x01

//#define isEPD_W21_BUSY GPIO_ReadOutputDataBit(GPIOE, GPIO_Pin_13) // for solomen solutions
#define isEPD_W21_BUSY GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_5) // for solomen solutions

extern void driver_delay_us(unsigned int xus);
extern void driver_delay_xms(unsigned long xms);

void SPI_Write(unsigned char value);
void EPD_W21_WriteDATA(unsigned char command);
void EPD_W21_WriteCMD(unsigned char command);
void EPD_W21_WriteCMD_p1(unsigned char command,unsigned char para);
void EPD_W21_WriteCMD_p2(unsigned char command,unsigned char para1,unsigned char para2);
void EPD_W21_Write(unsigned char *value, unsigned char datalen);

void EPD_W21_WriteDispRam(unsigned char XSize,unsigned int YSize,
							unsigned char *Dispbuff);

void EPD_W21_WriteDispRamMono(unsigned char XSize,unsigned int YSize,
							unsigned char dispdata);
void EPD_W21_WriteDispRamVGray4(unsigned char XSize,unsigned int YSize);
void EPD_W21_WriteDispRamHGray4(unsigned char XSize,unsigned int YSize);
void EPD_W21_WriteDispRamChessboardMono(unsigned char XSize,
										unsigned int YSize,
										unsigned char Mode);
void EPD_W21_WriteDispRamVline(unsigned char XSize,unsigned int YSize);
void EPD_W21_WriteDispRamHline(unsigned char XSize,unsigned int YSize);
void EPD_W21_WriteDispRamDotArray(unsigned char XSize,unsigned int YSize);

#endif  //#ifndef _MCU_SPI_H_

/***********************************************************
						end file
***********************************************************/
